Repository: lukaszdaniel/Matrix
Catalog: po/R-*.po
Languages: pl

source: subscripts exceeding %s replaced with NA
pl: indeksy dolne przekraczające %s zastąpiono wartościami NA

source: such indexing must be by logical or 2-column numeric matrix
pl: takie indeksowanie musi być wykonane poprzez macierz logiczną lub 2-kolumnową macierz liczbową

source: sum(<abIndex>) is not yet implemented
pl: 'sum(<abIndex>)' nie jest jeszcze zaimplementowane

source: suppressing %d columns
pl: pomijanie %d kolumn

source: suppressing %d columns and %d rows
pl: pomijanie %d kolumn oraz %d wierszy

source: suppressing %d rows
pl: pomijanie %d wierszy

source: symmetric matrix must be square
pl: macierz symetryczna musi być kwadratowa

source: symmetry form '%s' is not yet implemented
pl: forma symetryczna '%s' nie jest jeszcze zaimplementowana

source: symmetry form '%s' not recognized
pl: forma symetryczna '%s' nie została rozpoznana

source: symmetry form 'hermitian' not yet implemented for reading
pl: forma symetryczna 'hermitian' nie jest jeszcze zaimplementowana na potrzeby odczytu

source: symmetry form 'skew-symmetric' not yet implemented for reading
pl: forma symetryczna 'skew-symmetric' nie jest jeszcze zaimplementowana na potrzeby odczytu

source: the %d-th (sub)-diagonal (k = %d) is too short; filling with NA's
pl: (pod)-diagonala %d (k = %d) jest zbyt krótka; wypełnianie wartościami NA

source: the default value of argument '%s' of method '%s(<%s>, <%s>)' may change from %s to %s as soon as the next release of Matrix; set '%s' when programming
pl: domyślna wartość argumentu '%s' metody '%s(<%s>, <%s>)' może ulec zmianie z %s na %s wraz w następnym wydaniem pakietu 'Matrix'; ustaw '%s' podczas programowania

source: too many arguments
pl: zbyt wiele argumentów

source: too many replacement values
pl: zbyt dużo wartości zamieniających

source: triangular matrix must be square
pl: macierz trójkątna musi być kwadratowa

source: trimmed means are not defined for complex data
pl: przycięte średnie nie są zdefiniowane dla danych złożonych

source: type '%s' not recognized
pl: typ '%s' nie został rozpoznany

source: uniDiag=TRUE, but not all diagonal entries are 1
pl: uniDiag=TRUE, ale nie wszystkie elementy diagonalne mają wartość 1

source: uniDiag=TRUE, not all entries in diagonal coded as 1
pl: uniDiag=TRUE, nie wszystkie elementy diagonalne zakodowano jako 1

source: use Diagonal() to construct diagonal (symmetric && triangular) sparse matrices
pl: użyj Diagonal() do konstruowania diagonalnych (symetrycznych i trójkątnych) macierzy rzadkich

source: using "old code" part in Csparse subassignment
pl: używanie części 'old code' w przypisaniu w 'Csparse'

source: using "old code" part in Csparse subassignment >>> please report to Matrix-authors@r-project.org
pl: używanie części 'old code' w przypisaniu w 'Csparse' >>> proszę zgłosić raport na adres 'Matrix-authors@r-project.org'

source: variable '%s' is absent, its contrast will be ignored
pl: zmienna '%s' jest nieobecna, jej kontrast zostanie zignorowany

source: vector too long in Matrix - vector operation
pl: wektor jest zbyt długi w operacji macierz-wektor

source: when 'A' is specified, 'A.x' and 'At.x' are disregarded
pl: gdy 'A' jest określone, 'A.x' oraz 'At.x' są odrzucane

source: wrong sign in 'by' argument
pl: niepoprawny znak w argumencie 'by'

source: x / 0 for an <abIndex> x with sign-change no longer representable as 'rleDiff'
pl: x / 0 dla '<abIndex> x' ze zmianą znaku nie jest dłużej reprezentowalne jako 'rleDiff'

source: x[.,.] <- val : x being coerced from Tsparse* to CsparseMatrix
pl: x[.,.] <- wartość : 'x' zostaje przekształcone z 'Tsparse*' na 'CsparseMatrix'

source: x[.,.] <- val: x is %s, val not in {TRUE, FALSE} is coerced NA |--> TRUE.
pl: x[.,.] <- wartość: 'x' to %s, wartość nie w zakresie {TRUE, FALSE} zostaje przekształcona NA |--> TRUE.

source: x[.,.] <- val: x is %s, val not in {TRUE, FALSE} is coerced.
pl: x[.,.] <- wartość: 'x' to %s, wartość nie w zakresie {TRUE, FALSE} zostaje przekształcona.

source: x[.] <- val: x is %s, val not in {TRUE, FALSE} is coerced.
pl: x[.] <- wartość: 'x' to %s, wartość nie w zakresie {TRUE, FALSE} zostaje przekształcona.

source: x[.] <- val: x is %s, val not in {TRUE, FALSE} is coerced; NA |--> TRUE.
pl: x[.] <- wartość: 'x' to %s, wartość nie w zakresie {TRUE, FALSE} zostaje przekształcona; NA |--> TRUE.

source: you cannot mix negative and positive indices
pl: nie można mieszać ujemnych oraz dodatnich indeksów

source: [[ suppressing %d column name %s ... ]]
pl: [[ zmniejszanie %d nazwy kolumny %s ... ]]

source: 'diagonals' matrix must have %d column (= length(k) )
pl: macierz 'diagonals' musi mieć %d kolumnę (= length(k) )

source: readMM(): expected %d entries but found only %d
pl: readMM(): oczekiwano %d wpisu, ale znaleziono tylko %d
