Repository: lukaszdaniel/Matrix
Catalog: po/R-*.po
Languages: pl

source: %1$s(%2$s) is undefined: '%2$s' is not positive semidefinite
pl: %1$s(%2$s) jest niezdefiniowane: '%2$s' nie jest dodatnio określone

source: %s is not an integer multiple of length(x)
pl: %s nie jest całkowitą wielokrotnością 'length(x)'

source: %s length cannot exceed %s
pl: długość %s nie może przekroczyć %s

source: %s(<%s>) is not yet implemented
pl: funkcja %s(<%s>) nie jest jeszcze zaimplementowana

source: %s(<%s>, <%s>) is not yet implemented; ask maintainer("%s") to implement the missing method
pl: funkcja %s(<%s>, <%s>) nie jest jeszcze zaimplementowana; poproś opiekuna pakietu ("%s") o implementację brakującej metody

source: %s="%s" invalid for %s@uplo="%s"
pl: %s="%s" jest niepoprawna dla %s@uplo="%s"

source: '%1$s' is computationally singular, rcond(%1$s)=%2$g
pl: '%1$s' jest obliczeniowo osobliwy, rcond(%1$s)=%2$g

source: '%1$s' is not "%2$s", "%3$s", or "%2$s."
pl: '%1$s' nie jest "%2$s", "%3$s", ani "%2$s."

source: '%1$s' is not "%2$s1", "%2$s1.", "%2$s2", "%2$s2.", "%3$s", "%3$s1", "%4$s", or "%4$s1"
pl: '%1$s' nie jest "%2$s1", "%2$s1.", "%2$s2", "%2$s2.", "%3$s", "%3$s1", "%4$s", ani "%4$s1"

source: '%1$s' is not "%2$s1", "%2$s1.", "%2$s2", "%2$s2.", "%3$s", or "%4$s"
pl: '%1$s' to nie "%2$s1", "%2$s1.", "%2$s2", "%2$s2.", "%3$s", ani "%4$s"

source: '%1$s' is not "%2$s1", "%2$s1.", "%3$s", "%3$s.", "%3$s1", "%3$s1.", or "%4$s"
pl: '%1$s' nie jest "%2$s1", "%2$s1.", "%3$s", "%3$s.", "%3$s1", "%3$s1.", ani "%4$s"

source: '%1$s' is not "%2$s1", "%2$s1.", "%3$s", or "%4$s"
pl: '%1$s' nie jest "%2$s1", "%2$s1.", "%3$s", ani "%4$s"

source: '%1$s' is not formally symmetric; factorizing tcrossprod(%1$s)
pl: '%1$s' nie jest formalnie symetryczny; Faktoryzacja TcrossProd(%1$s)

source: '%s' and '%s' must be positive integers
pl: '%s' oraz '%s' muszą być dodatnimi liczbami całkowitymi

source: '%s' contains NA
pl: '%s' zawiera wartość NA

source: '%s' does not inherit from virtual class %s
pl: '%s' nie dziedziczy z klasy wirtualnej %s

source: '%s' has elements exceeding '%s'
pl: '%s' ma elementy przekraczające '%s'

source: '%s' has elements less than %d
pl: '%s' ma elementy mniejsze niż %d

source: '%s' has length 0 but '%s' does not
pl: '%s' ma długość 0, ale '%s' nie

source: '%s' has non-finite values
pl: '%s' ma wartości nieskończone

source: '%s' has the wrong length
pl: '%s' ma nieprawidłową długość

source: '%s' is computationally singular, min(d)/max(d)=%g, d=abs(diag(U))
pl: '%s' jest obliczeniowo osobliwe, min(d)/max(d)=%g, d=abs(diag(U))

source: '%s' is deprecated; setting %s="%s"
pl: '%s' jest przestarzałe; ustawienie %s="%s"

source: '%s' is deprecated; using '%s' instead
pl: '%s' jest przestarzałe; zamiast tego używanie '%s'

source: '%s' is not "%1$s", "D%1$s", or "%1$s."
pl: '%s' nie jest "%1$s", "D%1$s", lub "%1$s."

source: '%s' is not %d or %d
pl: '%s' nie jest %d ani %d

source: '%s' is not a non-negative number
pl: '%s' nie jest liczbą nieujemną

source: '%s' is not a permutation of seq_len(%s)
pl: '%s' nie jest permutacją seq_len(%s)

source: '%s' is not a square numeric matrix
pl: '%s' nie jest kwadratową macierzą liczbową

source: '%s' is not of type "%s" or "%s"
pl: '%s' nie jest typu "%s" ani "%s"

source: '%s' is not square
pl: '%s' nie jest macierzą kwadratową

source: '%s' method must use default %s="%s"
pl: metoda '%s' musi używać domyślnego %s="%s"

source: '%s' via sparse -> dense coercion
pl: automatyczna konwersja '%s' przez sparse -> dense

source: '%s()' is not yet implemented for element type '%s'
pl: '%s()' nie jest jeszcze zaimplementowany dla typu '%s' elementu

source: '%s()' is not yet implemented for representation '%s'
pl: '%s()' nie jest jeszcze zaimplementowane dla reprezentacji '%s'

source: 'A' must be a square matrix
pl: 'A' musi być macierzą kwadratową

source: 'NA' indices are not (yet?) supported for sparse Matrices
pl: indeksy 'NA' nie są (jeszcze?) wspierane dla rzadkich macierzy

source: 'by' argument is much too small
pl: argument 'by' jest znacznie za mały

source: 'cl' is not a character string
pl: 'cl' nie jest ciągiem znaków

source: 'cols' has elements not in seq(0, length.out = n)
pl: 'cols' ma elementy, które nie znajdują się w 'seq(0, length.out = n)'

source: 'cols' must be numeric
pl: argument 'cols' musi być liczbą

source: 'contrasts.arg' argument must be named
pl: argument 'contrasts.arg' musi być nazwany

source: 'diagonals' must have the same length (%d) as 'k'
pl: 'diagonals' musi mieć tę samą długość (%d) co 'k'

source: 'dims' must contain all (i,j) pairs
pl: 'dims' musi zawierać wszystkie pary (i,j)

source: 'file' must be a character string or connection
pl: 'file' musi być tekstem lub połączeniem

source: 'force' must be (coercable to) TRUE or FALSE
pl: 'force' musi być (przekształcalne do) TRUE lub FALSE

source: 'giveCsparse' has been deprecated; setting 'repr = "T"' for you
pl: parametr "giveCsparse" jest przestarzały; ustawienie 'repr="T"'

source: 'giveCsparse' has been deprecated; will use 'repr' instead
pl: parametr "giveCsparse" jest przestarzały; ustawianie 'repr'

source: 'giveCsparse' is deprecated; setting repr="T" for you
pl: parametr "giveCsparse" jest przestarzały; ustawienie 'repr="T"'

source: 'giveCsparse' is deprecated; using 'repr' instead
pl: 'giveCsparse' jest przestarzałe; zamiast tego przy użyciu 'repr'

source: 'i' and 'j' must be non-negative
pl: argumenty 'i' oraz 'j' muszą być nieujemne

source: 'i' and 'j' must be positive
pl: argumenty 'i' oraz 'j' muszą być dodatnie

source: 'i' and 'j' must not contain NA
pl: 'i' oraz 'j' nie mogą zawierać wartości NA

source: 'kind' must be one of "d", "l", "n"
pl: 'kind' musi być jednym z "d", "l", "n"

source: 'lst' must be a list
pl: 'lst' musi być listą

source: 'lwd' must be NULL or non-negative numeric
pl: 'lwd' musi mieć wartość NULL lub być nieujemną liczbą

source: 'n' must be a non-negative integer
pl: 'n' musi być nieujemną liczbą całkowitą

source: 'ncol' is not a factor of length(x)
pl: 'ncol' nie jest czynnikiem długości 'length(x)'

source: 'ncol' must be >= 0
pl: 'ncol' musi być >= 0

source: 'nearPD()' did not converge in %d iterations
pl: funkcja 'nearPD()' nie uzbieżniła się w %d iteracjach

source: 'nrow' and 'ncol' must be the same when 'symmetric' is true
pl: 'nrow' oraz 'ncol' muszą mieć tę samą wartość gdy 'symmetric' ma wartość TRUE

source: 'nrow' is not a factor of length(x)
pl: 'nrow' nie jest czynnikiem długości 'length(x)'

source: 'nrow' must be >= 0
pl: 'nrow' musi być >= 0

source: 'nrow', 'ncol', 'byrow' disregarded for [mM]atrix 'data'
pl: 'nrow', 'ncol', 'byrow' są nieuwzględniane dla 'data' typu macierzowego

source: 'p' must be a nondecreasing vector c(0, ...)
pl: 'p' musi być niemalejącym wektorem c(0, ...)

source: 'shape' must be one of "g", "t", "s"
pl: 'shape' musi być jednym z "g", "t", "s"

source: 'uplo' must be "U" or "L"
pl: argument 'uplo' musi mieć wartość "U" lub "L"

source: 'x' has unsupported class "%s"
pl: 'x' ma nieobsługiwaną klasę "%s"

source: 'x' has unsupported type "%s"
pl: 'x' ma nieobsługiwany typ "%s"

source: 'x' must have length nrow^2 when 'symmetric' is true
pl: 'x' musi mieć długość równą 'nrow'^2 gdy 'symmetric' ma wartość TRUE

source: 'x' must inherit from "sparseVector"
pl: argument 'x' musi być obiektem klasy "sparseVector"

source: .M.repl.i.2col(): 'i' has no integer column number; should never happen; please report
pl: .M.repl.i.2col(): 'i' posiada niecałkowitą liczbę kolumn; to nie powinno się nigdy wydarzyć; proszę zgłosić raport

source: .M.repl.i.2col(): drop 'matrix' case ...
pl: .M.repl.i.2col(): zrzuć przypadek 'matrix' ...

source: <abIndex> --> <seqMat> is not yet implemented
pl: <abIndex> --> <seqMat> nie jest jeszcze zaimplementowane

source: <abIndex>[i] is not yet implemented
pl: '<abIndex>[i]' nie jest jeszcze zaimplementowane

source: <seqMat> --> <abIndex> is not yet implemented
pl: <seqMat> --> <abIndex> nie jest jeszcze zaimplementowane

source: Class %s is not yet implemented
pl: Klasa %s nie jest jeszcze zaimplementowana

source: Cmp.Mat.atomic() should not be called for diagonalMatrix
pl: 'Cmp.Mat.atomic()' nie powinien być wywołany dla 'diagonalMatrix'

source: Compare <Csparse> -- "%s" %s "%s" :
pl: Porównaj <Csparse> -- "%s" %s "%s" :

source: D[i,i] is NA, i=%d
pl: D[i,i] ma wartość NA, i=%d

source: D[i,i] is negative, i=%d
pl: D[i,i] jest ujemne, i=%d

source: Internal bug: nargs()=%d; please report
pl: Błąd wewnętrzny: nargs()=%d; proszę zgłosić raport

source: Invalid assembled indicator: %s
pl: Niepoprawnie złożony wskaźnik: %s

source: Invalid storage format: %s
pl: Niepoprawny format przechowywania: %s

source: Invalid storage type: %s
pl: Niepoprawny typ przechowywania: %s

source: Logic.Mat.atomic() should not be called for diagonalMatrix
pl: 'Logic.Mat.atomic()' nie powinien być wywołany dla 'diagonalMatrix'

source: Matrices must have same number of rows for arithmetic
pl: Macierze muszą mieć tę samą liczbę wierszy jeśli mają być przeprowadzane działania arytmetyczne

source: Matrix seems negative semi-definite
pl: Macierz wydaje się być ujemnie określona

source: Must specify 'nrow' when 'symmetric' is true
pl: 'nrow' musi być określone, gdy 'symmetric' ma wartość TRUE

source: NAs are not allowed in subscripted assignments
pl: wartości NA nie są dozwolone w indeksowanych przypisaniach

source: Not a valid format
pl: Niepoprawny format

source: Only numeric sparse matrices allowed
pl: Dozwolone są jedynie liczbowe rzadkie macierze

source: RHS 'value' (class %s) matches 'ANY', but must match matrix class %s
pl: prawa strona 'value' (klasa %s) pasuje do 'ANY', a musi pasować do klasy macierzy '%s'

source: [ <character> ] indexing not allowed: forgot a "," ?
pl: indeksowanie [ <tekst> ] nie jest dozwolone: zapomniałeś ',' ?

source: a sparseMatrix should rarely be centered: will not be sparse anymore
pl: sparseMatrix rzadko kiedy powinien być wyśrodkowany: macierz nie będzie już rzadka

source: all(<abIndex>) is not yet implemented
pl: 'all(<abIndex>)' nie jest jeszcze zaimplementowane

source: assigned dimensions [product %.0f] do not match object length [%.0f]
pl: przypisane wymiary [produkt %.0f] nie zgadzają się z długością obiektu [%.0f]

source: assigned dimensions are NA
pl: przypisane wymiary mają wartość NA

source: assigned dimensions are negative
pl: przypisane wymiary są ujemne

source: assigned dimensions are not of type "%s" or "%s"
pl: przypisane wymiary nie są typu "%s" ani "%s"

source: assigned dimensions do not have length %d
pl: przypisane wymiary nie mają długości %d

source: assigned dimensions exceed %s
pl: przypisane wymiary przekraczają %s

source: attempt to coerce matrix with NA to %s
pl: próba wymuszenia macierzy z wartościami NA do %s

source: attempt to coerce non-square matrix to %s
pl: próba przekształcenia macierzy niekwadratowej w %s

source: attempt to recycle 'x' of length 0 to length 'n' (n > 0)
pl: próba przetworzenia 'x' o długości 0 na długość 'n' (n > 0)

source: c(<abIndex>,..) of different kinds, coercing all to 'rleDiff'
pl: 'c(<abIndex>,..)' różnych rodzajów, przekształcanie wszystkich do 'rleDiff'

source: cannot coerce from %s to %s
pl: nie można przekształcić z %s na %s

source: cannot coerce matrix of type "%s" to %s
pl: nie można przekształcić macierzy typu "%s" w %s

source: column indices must be <= ncol(.) which is %d
pl: indeksy kolumn muszą być <= 'ncol(.)' który wynosi %d

source: complex %s not yet implemented
pl: zespolone %s jeszcze nie zaimplementowane

source: data is too long
pl: dane są za długie

source: determinant of non-square matrix is undefined
pl: wyznacznik macierzy niekwadratowej jest niezdefiniowany

source: diag(%s) has non-positive or non-finite entries; finite result is doubtful
pl: 'diag(%s)' posiada wpisy niedodatnie lub nieskończone; skończony wynik jest wątpliwy

source: dim [product %d] do not match the length of object [%d]
pl: wymiar [produkt %d] nie zgadza się z długością obiektu [%d]

source: dimensions cannot exceed %s
pl: wymiary nie mogą przekroczyć %s

source: dimensions cannot exceed 2^31-1
pl: wymiary nie mogą przekraczać 2^31-1

source: dimensions of '%s' and '%s' are inconsistent
pl: wymiary '%s' oraz '%s' są niespójne

source: dimnames [%d] mismatch in %s
pl: niezgodność nazw wymiarów [%d] w %s

source: element type '%s' not recognized
pl: element typu '%s' nie został rozpoznany

source: element type 'complex' not yet implemented
pl: typ elementu 'complex' nie jest jeszcze zaimplementowany

source: exactly one of 'i', 'j', and 'p' must be missing from call
pl: dokładnie jeden z 'i', 'j', lub 'p' musi być nieobecny w wywołaniu

source: file is not a MatrixMarket file
pl: plik nie jest plikiem typu 'MatrixMarket'

source: first element used of '%s' argument
pl: użyto pierwszego elementu argumentu '%s'

source: for symmetric band matrix, only specify upper or lower triangle hence, all k must have the same sign
pl: dla symetrycznej macierzy wstęgowej, określ jedynie górny oraz dolny trójkąt tak więc, wszystkie k muszą mieć ten sam znak

source: hit a cycle (1) -- stop iterations
pl: natrafiono na cykl (1) -- zatrzymywanie iteracji

source: hit a cycle (2) -- stop iterations
pl: natrafiono na cykl (2) -- zatrzymywanie iteracji

source: i1[1] == 0 ==> C-level verbosity will not happen!
pl: i1[1] == 0 ==> tryb 'verbose' poziomu C nie zostanie wykonany!

source: in show(); maybe adjust options(max.print=, width=)
pl: w 'show()'; być może ustaw 'options(max.print=, width=)'

source: incorrect number of dimensions
pl: nieprawidłowa liczba wymiarów

source: index larger than maximal %d
pl: indeks dłuższy niż maksymalny możliwy %d

source: index must be numeric, logical or sparseVector for indexing sparseVectors
pl: indeks musi być typem liczbowym, logicznym lub obiektem klasy 'sparseVector' na potrzeby indeksowania obiektów klasy 'sparseVector'

source: inefficient method used for "- e1"
pl: nieefektywna metoda użyta dla '- e1'

source: intermediate 'r' is of type %s
pl: pośrednie 'r' jest typu %s

source: internal bug in "Compare" method (Cmp.Mat.atomic); please report
pl: błąd wewnętrzny w metodzie 'Compare' (Cmp.Mat.atomic); proszę zgłosić raport

source: internal bug in "Logic" method (Logic.Mat.atomic); please report
pl: błąd wewnętrzny w metodzie 'Logic' (t.j. .Logic.Mat.atomic); proszę zgłosić raport

source: internal bug: matrix 'i' in replTmat(): please report
pl: wewnętrzny błąd: macierz 'i' w 'replTmat()': proszę zgłosić raport

source: internal bug: missing 'i' in replTmat(): please report
pl: błąd wewnętrzny: brakuje 'i' w 'replTmat()': proszę zgłosić raport

source: invalid %s="%s"
pl: niepoprawna wartość %s="%s"

source: invalid %s="%s" to '%s'
pl: niepoprawna wartość %s="%s" przekazana do '%s'

source: invalid '%s' argument
pl: niepoprawny argument '%s'

source: invalid '%s': not in %d:%d
pl: niepoprawny ciąg '%s': nie w %d:%d

source: invalid 'Class2'
pl: niepoprawne 'Class2'

source: invalid 'col.names' string: %s
pl: niepoprawny tekst 'col.names': %s

source: invalid 'data'
pl: niepoprawne 'data'

source: invalid 'dims'
pl: niepoprawne 'dims'

source: invalid 'repr'; must be "C", "T", or "R"
pl: nieprawidłowy argument 'repr'; musi mieć wartość "C", "T" lub "R"

source: invalid (to - from)/by in seq(.)
pl: niepoprawne '(to - from)/by' w 'seq(.)'

source: invalid character indexing
pl: niepoprawne tekstowe indeksowanie

source: invalid class "%s" in '%s'
pl: niepoprawna klasa "%s" w '%s'

source: invalid class "%s" in '%s' method
pl: niepoprawna klasa "%s" w metodzie '%s'

source: invalid class "%s" object in '%s' method
pl: niepoprawna klasa "%s" obiektu w metodzie '%s'

source: invalid mode "%s"
pl: niepoprawny tryb "%s"

source: invalid nargs()= %d
pl: niepoprawne nargs()=%d

source: invalid subassignment value class "%s"
pl: nieprawidłowa klasa wartości przypisania "%s"

source: invalid subassignment value type "%s"
pl: nieprawidłowy typ wartości przypisania "%s"

source: invalid subscript class "%s"
pl: nieprawidłowa klasa indeksu dolnego "%s"

source: invalid subscript type "%s"
pl: niepoprawny typ indeksu dolnego "%s"

source: invalid type "%s" in '%s'
pl: niepoprawny typ "%s" w '%s'

source: invalid type "%s" in '%s' method
pl: niepoprawny typ "%s" w metodzie '%s'

source: length must be non-negative number
pl: długość musi być nieujemną liczbą

source: length of 'center' must equal the number of columns of 'x'
pl: długość argumentu 'center' musi równać się liczbie kolumn argumentu 'x'

source: length of 'scale' must equal the number of columns of 'x'
pl: długość argumentu 'scale' musi równać się liczbie kolumn argumentu 'x'

source: length of 1st arg does not match dimension of 2nd
pl: długość pierwszego argumentu nie zgadza się z wymiarem drugiego

source: length of 2nd arg does not match dimension of first
pl: długość drugiego argumentu nie zgadza się z wymiarem pierwszego

source: length(x) must not exceed %s
pl: 'length(x)' nie może przekraczać %s

source: logic programming error in printSpMatrix2(), please report
pl: błąd logiczny programu w 'printSpMatrix2()', proszę zgłosić raport

source: logical subscript too long
pl: indeks logiczny jest zbyt długi

source: logical subscript too long (%d, should be %d)
pl: indeks logiczny jest zbyt długi (%d, powinien być %d)

source: longer object length is not a multiple of shorter object length
pl: długość dłuższego obiektu nie jest wielokrotnością długości krótszego obiektu

source: m[ <ij-matrix> ] <- v: inefficiently treating single elements
pl: m[ <ij-matrix> ] <- v: nieefektywne traktowanie pojedynczych elementów

source: matrix can only be symmetric if square, but n != m
pl: macierz może być symetryczna tylko jeśli jest kwadratowa, ale n != m

source: matrix exactly singular, J[i,]=0, i=%d
pl: macierz jest dokładnie osobliwa, J[i,]=0, i=%d

source: matrix is exactly singular, D[i,i]=0, i=%d
pl: macierz jest dokładnie osobliwa, D[i,i]=0, i=%d

source: matrix is exactly singular, J[,j]=0, j=%d
pl: macierz jest dokładnie osobliwa, J[,j]=0, j=%d

source: matrix is not diagonal; consider Diagonal(x=diag(.))
pl: macierz nie jest diagonalna; rozważ 'Diagonal(x=diag(.))'

source: matrix is not square
pl: macierz nie jest kwadratowa

source: matrix is not symmetric
pl: macierz nie jest symetryczna

source: matrix is not symmetric or triangular
pl: macierz nie jest symetryczna ani trójkątna

source: matrix is not symmetric; consider forceSymmetric(.) or symmpart(.)
pl: macierz nie jest symetryczna; rozważ 'forceSymmetric(.)' lub 'symmpart(.)'

source: matrix is not triangular
pl: macierz nie jest trójkątna

source: matrix is not triangular; consider triu(.) or tril(.)
pl: macierz nie jest trójkątna; rozważ 'triu(.)' lub 'tril(.)'

source: matrix is structurally rank deficient; using augmented matrix with additional %d row(s) of zeros
pl: macierz ma strukturalnie niedobór rangi; Używanie rozszerzonej macierzy z dodatkowymi %d wierszami zer

source: matrix must have exactly one entry in each row and column
pl: macierz musi mieć dokładnie jeden wpis w każdym wierszu oraz kolumnie

source: matrix must have exactly one entry in each row or column
pl: macierz musi mieć dokładnie jeden wpis w każdym wierszu lub kolumnie

source: mismatch between typeof(x)="%s" and kind="%s"; using kind="%s"
pl: niezgodność między typeof(x)="%s" a kind="%s"; używanie kind="%s"

source: missing subassignment value
pl: brak wartości przypisania

source: model frame and formula mismatch in sparse.model.matrix()
pl: ramka modelu oraz formuła nie zgadzają się w 'sparse.model.matrix()'

source: must either specify 'A' or the functions 'A.x' and 'At.x'
pl: potrzeba określić 'A' lub funkcje 'A.x' oraz 'At.x'

source: nargs() = %d should never happen; please report.
pl: 'nargs() = %d' nie powinno się wydarzyć; proszę zgłosić raport.

source: nargs() = %d. Extraneous illegal arguments inside '[ .. ]' ?
pl: nargs() = %d. Obce nielegalne argumenty wewnątrz '[ .. ]' ?

source: need greater '%s' as pivoting occurred
pl: potrzeba większego '%s', ponieważ nastąpiło przestawienie

source: negative values are not allowed in a matrix subscript
pl: ujemne wartości nie są dozwolone w indeksach macierzy

source: no 'dimnames[[.]]': cannot use character indexing
pl: brak 'dimnames[[.]]': nie można używać indeksowania tekstowego

source: non-conformable arguments
pl: niezgodne argumenty

source: non-conformable matrix dimensions in %s
pl: niezgodne wymiary macierzy w %s

source: non-list contrasts argument ignored
pl: argument kontrastów niebędących listą został zignorowany

source: non0.i() not yet implemented for class %s
pl: funkcja 'non0.i()' nie jest jeszcze zaimplementowana dla klasy %s

source: not a positive definite matrix (and positive semidefiniteness is not checked)
pl: to nie jest dodatnio określona macierz (a dodatnia półokreśloność nie jest sprawdzana)

source: not converged in %d iterations
pl: nie uzbieżnił się w %d iteracjach

source: not enough new vecs -- stop iterations
pl: zbyt mało nowych wektorów -- zatrzymywanie iteracji

source: not yet implemented
pl: jeszcze niezaimplementowane

source: not yet implemented .. please report
pl: jeszcze niezaimplementowane .. proszę zgłosić raport

source: not-yet-implemented 'Matrix[<-' method
pl: jeszcze niezaimplementowana metoda 'Matrix[<-'

source: nothing to replace with
pl: nic do zastąpienia

source: number of items to replace is not a multiple of replacement length
pl: liczba pozycji do zastąpienia nie jest wielokrotnością długości elementu zastępującego

source: number of nonzero entries cannot exceed %s
pl: liczba niezerowych wpisów nie może przekroczyć %s

source: number of rows are not compatible for %s
pl: liczba wierszy nie jest zgodna dla %s

source: only square matrices can be used as graph incidence matrices
pl: tylko kwadratowe macierze mogą zostać użyte jako macierz incydencji dla grafów

source: only zeros may be mixed with negative subscripts
pl: tylko zera mogą być mieszane z ujemnymi indeksami

source: prod(<abIndex>) is not yet implemented
pl: 'prod(<abIndex>)' nie jest jeszcze zaimplementowane

source: qr2rankMatrix(.): QR with only %d out of %d finite diag(R) entries
pl: qr2rankMatrix(.): QR tylko z %d z %d skończonych elementów diag(R)

source: rankMatrix(<large sparse Matrix>, method = '%s') coerces to dense matrix. Probably should rather use method = 'qr' !?
pl: rankMatrix(<duża rzadka macierz>, method = '%s') przekształca macierz do gęstej macierzy. Prawdopodobnie należy użyć 'method = "qr"' !?

source: rankMatrix(x, method='qr'): computing t(x) as nrow(x) < ncol(x)
pl: rankMatrix(x, method='qr'): obliczanie t(x) jako nrow(x) < ncol(x)

source: readMM(): column indices 'j' are not in 1:ncol[=%d]
pl: readMM(): indeksy kolumny 'j' nie są w przedziale 1:ncol[=%d]

source: readMM(): row indices 'i' are not in 1:nrow[=%d]
pl: readMM(): indeksy wiersza 'i' nie są w przedziale 1:nrow[=%d]

source: recycled %s would have maximal index exceeding %s
pl: przetworzone '%s' miałoby maksymalny indeks przekraczający %s

source: replacement diagonal has incompatible type "%s"
pl: przekątna zastępująca ma niezgodny typ "%s"

source: replacement diagonal has wrong length
pl: przekątna zastępująca ma niepoprawną długość

source: replacement has length zero
pl: zamiennik ma długość zero

source: representation '%s' not recognized
pl: reprezentacja '%s' nie została rozpoznana

source: row indices must be <= nrow(.) which is %d
pl: indeksy wiersza muszą być <= 'nrow(.)' który wynosi %d

source: should never happen ...
pl: to nie powinno się nigdy zdarzyć...

source: sparse to dense (%s) coercion in '%s' -> %s
pl: konwersja sparse na dense (%s) w '%s' -> %s

source: suboptimal 'Arith' implementation of 'dsC* o dsC*'
pl: nieoptymalna implementacja 'Arith' 'dsC* o dsC*'

source: subscript out of bounds
pl: indeks poza granicami
